CSI API ETABS v1
cPropMaterial.GetSSCurve Method
 Retrieves the material stress-strain curve.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSSCurve(
	string Name,
	ref int NumberPoints,
	ref int[] PointID,
	ref double[] Strain,
	ref double[] Stress,
	string SectName = "",
	double RebarArea = 0,
	double Temp = 0
)
Function GetSSCurve (
	Name As String,
	ByRef NumberPoints As Integer,
	ByRef PointID As Integer(),
	ByRef Strain As Double(),
	ByRef Stress As Double(),
	Optional SectName As String = "",
	Optional RebarArea As Double = 0,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim NumberPoints As Integer
Dim PointID As Integer()
Dim Strain As Double()
Dim Stress As Double()
Dim SectName As String
Dim RebarArea As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.GetSSCurve(Name,
	NumberPoints, PointID, Strain, Stress,
	SectName, RebarArea, Temp)
int GetSSCurve(
	String^ Name,
	int% NumberPoints,
	array<int>^% PointID,
	array<double>^% Strain,
	array<double>^% Stress,
	String^ SectName = L"",
	double RebarArea = 0,
	double Temp = 0
)
abstract GetSSCurve :
        Name : string *
        NumberPoints : int byref *
        PointID : int[] byref *
        Strain : float[] byref *
        Stress : float[] byref *
        ?SectName : string *
        ?RebarArea : float *
        ?Temp : float
(* Defaults:
        let _SectName = defaultArg SectName ""
        let _RebarArea = defaultArg RebarArea 0
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing material property.
NumberPoints
Type: System.Int32
The number of points in the stress-strain curve.
PointID
Type: System.Int32[]
This is one of the following integers which sets the point ID. The point ID controls the color that will be displayed for hinges in a deformed shape plot.
Value | Point ID
-5 | -E
-4 | -D
-3 | -C
-2 | -B
-1 | -A
0 | None
1 | A
2 | B
3 | C
4 | D
5 | E
Strain
Type: System.Double[]
This is an array that includes the strain at each point on the stress strain curve.
Stress
Type: System.Double[]
This is an array that includes the stress at each point on the stress strain curve. [F/L2]
SectName (Optional)
Type: System.String
This item applies only if the specified material is concrete with a Mander concrete type.
This is the frame section property for which the Mander stress-strain curve is retrieved.
The section must be round or rectangular
RebarArea (Optional)
Type: System.Double
This is the area of the rebar for which the stress-strain curve is retrieved.
This item applies only if the specified material is rebar, which does not have a user-defined stress-strain curve and is specified to use Caltrans default controlling strain values, which are bar size dependent.
Temp (Optional)
Type: System.Double
The temperature at which the specified data is to be retrieved. The temperature must have been defined previously for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberPoints As Integer
       Dim PointID() As Integer
       Dim Strain() As Double
       Dim Stress() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get stress strain curve
       ret = SapModel.PropMaterial.GetSSCurve("A992Fy50", NumberPoints, PointID, Strain, Stress)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace